data = [
    {
        "img": "../images/huawei_y6.jpg",
        "alt": "Huawei_Y6",
        "nazov": "Huawei Y6 2019",
        "popis": "Mobilní telefon 6.09 palca IPS LCD 1520 x 720, procesor Mediatek MT6761 Quad-Core (2GHz), Interní paměť 32 GB, RAM 2 GB, Hybridní slot, fotoaparát 13 Mpx, Wi-Fi, Bluetooth, LTE (4G)/ 3G, GPS, FM rádio,...",
        "os": "Android",
        "display": "6,09 palca",
        "cely_popis": "Vyberáte si nový mobil a radi by ste siahli po takom, ktorý bude dôkazom príslovia, že za málo peňazí môžete kúpiť veľa muziky? V tom prípade by sme vám radi predstavili smartfón Huawei Y6 2019, ktorého zásadnou prednosťou je práve perfektný pomer cena/výkon. Ponúka spoľahlivé hardvérové ??aj softvérové ??zázemie, špičkový displej s nadštandardnou uhlopriečkou aj celý rad vyspelých šikovných funkcií. Môžete sa tešiť na dvojicu kvalitných fotoaparátov, vstavanú GPS navigáciu aj podporu rýchleho 4G/LTE internetu. Samozrejmosťou je tu potom aj moderný Wi-Fi modul a bezdrôtová technológia Bluetooth. A nechýbajú ani také vymoženosti, ako je napr. funkcia odomykania telefónu rozpoznaním vašej tváre alebo zvukový party režim. Tento dostupný prístroj má skrátka vážne čo ponúknuť. Huawei Y6 2019 je smartfón plný kontrastov. Dostupný, a pritom výkonný. Veľký, a napriek tomu sa skvele ovláda. Krásny aj šikovný zároveň."
    },
    {
        "img": "../images/motorola_moto_G.jpg",
        "alt": "Motorola Moto G Pro",
        "nazov": "Motorola Moto G Pro",
        "popis": "Motorola Moto G Pro je špičkový inteligentný telefón, ktorý má celý rad predností.",
        "os": "Android",
        "display": " 6,4 palca",
        "cely_popis": "Motorola Moto G Pro je špičkový inteligentný telefón, ktorý má celý rad predností. Okrem iného vás iste oslní vysokým výpočtovým výkonom, veľkým Full HD+ displejom či kvalitným trojitým fotoaparátom. Okrem toho však disponuje aj jednou vychytávkou, ktorá je v tejto triede smartfónov úplne výnimočná - podporuje ovládanie pomocou dotykového pera. Stylus, ktorým si môžete do mobilu písať poznámky alebo napríklad kresliť, sa pritom dá uložiť priamo do tela telefónu. Hardvérová výbava tohto smartfónu zahŕňa osemjadrový procesor Qualcomm Snapdragon 665, operačnú pamäť 4 GB RAM a grafický čip Adreno 610. Vďaka tomuto výkonnému zázemiu môžete využívať aj prepracované mobilné aplikácie alebo hrať náročné videohry. Na ukladanie aplikácií, multimédií aj ďalších dát pritom využijete internú pamäť prístroja, ktorá má kapacitu 128 GB a navyše sa dá rozšíriť vložením kompatibilnej microSD karty až o ďalších 512 GB."
    },
    {
        "img": "../images/samsung_galaxy_a10.jpg",
        "alt": "samsung_galaxy_a10",
        "nazov": "Samsung Galaxy A10",
        "popis": "A10 - 6.2 palcový IPS LCD displej, 720 x 1520 px., procesor Exynos 7884, 32 GB pamäť a 2 GB RAM, zadný 13 Mpx a predný 5 Mpx fotoaparát, Li-lon 3 400 mAh batéria, microUSB, FM Rádio, 3.5mm jack",
        "os": "Android",
        "display": "6.2 palca",
        "cely_popis": "Smartfón s veľkým displejom, na ktorom si všetko užijete viac ako doposiaľ. Radosť vám urobí aj vzhľad telefónu - vďaka jednoduchému dizajnu s ladnými krivkami a bez rušivých elementov vám sadne do ruky ako uliaty. Všetky spomienky si navždy uchováte jediným stlačením spúšte. Môžete ich ozvláštniť rôznymi filtrami alebo samolepkami a hneď poslať vašim priateľom. Aj keby ste si s nimi písali celý deň, vďaka veľkokapacitnej batérii nebudete potrebovať nabíjačku. Navyše všetko zostane zabezpečené špičkovými technológiami, ktoré sa postarajú o to, aby ste do telefónu mali prístup len vy sami."
    },
    {
        "img": "../images/huawei_y5p.jpg",
        "alt": "huawei_y5p",
        "nazov": "Huawei Y5p zelený",
        "popis": "Mobilný telefón 5.45 palcov IPS 1 440 × 720, procesor MediaTek MT6762 (Helio P22) 8-jadrový, RAM 2 GB, interná pamäť 32 GB, microSD až 512 GB, zadný fotoaparát 8 Mpx (f/2), predný fotoaparát 5 Mpx, GPS",
        "os": "Android",
        "display": "5.45 palcov",
        "cely_popis": "Huawei Y5p zelený je otvorený tovar, ktorý má buď originálny, alebo náhradný obal. Ide o nový produkt, ktorý bol rozbalený za účelom predvádzania či fotografovania pre e-shop. Môže pochádzať aj z vrátenia inými zákazníkmi. Tovar je v perfektnom stave. S produktom bolo šetrne zaobchádzané veľmi krátku dobu. Huawei Y5p zelený Má všetko príslušenstvo. Huawei Y5p zelený má štandardnú záruku 24 mesiacov. Huawei Y5p zelený môžete kúpiť aj ako nový tovar. Po zakúpení môžete tovar štandardne vrátiť do 14 dní."
    },
    {
        "img": "../images/realme_5.jpg",
        "alt": "realme_5",
        "nazov": "Realme 5 Dual SIM (RMX1911P)",
        "popis": "Mobilní telefon 6.5 palca 720 x 1600, procesor Snapdragon 665 Octa-Core (2GHz), Interní paměť 128 GB, RAM 4 GB, Dual SIM, Wi-Fi, Bluetooth, LTE (4G)/ 3G, GPS, 5000mAh, Android 9.0 Pie, oficiální distribuce",
        "os": "Android",
        "display": "6.5 palca",
        "cely_popis": "Značka Realme vstupuje na slovenský trh nadštandardne vybaveným smartfónom, ktorý smelo útočí na konkurentov v strednej triede. Model Realme 5 s podporou Dual SIM ponúka výkon 8-jadrového procesora, 128 GB internej pamäte, obrovský fullscreen displej, veľkokapacitnú batériu a kvalitný fotoaparát so štyrmi objektívmi a umelou inteligenciou. To všetko za nečakane nízku cenu. Veľký displej pre veľké zážitky. Sledujte filmy, natáčajte videá, upravujte fotky, surfujte po internete. Skvelé vizuálne zážitky vám zaistí fullscreen displej s uhlopriečkou 6,5 palcov a HD+ rozlíšením (720×1600 px). Obrazovka je vsadená do ultratenkých rámčekov s nenápadným mini-drop výrezom pre selfie kameru, ktorý vás nebude rušiť pri práci ani zábave. Smartfón Realme 5 využíva umelú inteligenciu pre krásne fotky aj úsporu energiu!"    },
    {
        "img": "../images/honor_7s.jpg",
        "alt": "Honor_7S",
        "nazov": "Honor 7S",
        "popis": "Smartfón Honor 7S v elegantnom čiernom prevedení, ponúka 5,45 palcový displej s rozlíšením 1440 x 720 bodov a pomerom strán 18:9. Štvorjadrový procesor MT6739 Quad Core je doplnený 2 GB operačný pamäť RAM a spolu sa starajú o kvalitný chod smartfónu.",
        "os": "Android",
        "display": "5,45 palcov",
        "cely_popis": "Smartfón Honor 7S ponúka elegantné čierne prevedenie a je tou správnou voľbou pre všetkých milovníkov štýlového dizajnu. Na prvý pohľad zaujme 5,45 palcovým displejom s rozlíšením 1440 x 720 pixelov, a technológiou IPS. Obrazovka s rozložením strán 18:9 poskytne vynikajúci obraz pri hraní hier, sledovaní videí alebo pri surfovaní po internete. Zábavu na plno si vychutnáte ešte viac a oveľa dlhšie, vďaka batérií s kapacitou 3020 mAh. O spoľahlivý výkon sa postará štvorjadrový procesor Mediatek MT6739, ktorý zabezpečí plynulú prevádzku telefónu. Spolu s 2 GB operačnou pamäťou RAM sa postarajú nielen o rýchly, ale aj kvalitný výkon smartfonu. Vybavený je tež 16 GB interným úložiskom, ktorý si viete rozšíriť pomocou microSD karty. Podporovaná kapacita pamäťovej karty je až 256 GB. Zaujímavé aplikácie získate vďaka platforme Android 8.1 Oreo. "
    },
    {
        "img": "../images/iphone8.jpg",
        "alt": "Apple_iPhone_8",
        "nazov": "Apple iPhone 8",
        "popis": "Nová sklenená konštrukcia je nielen krásna, umožňuje tiež že nový iPhone sa bude dobíjať bezdrôtovo. Súčasne s iPhone 8 plus budete tiež mať hĺbkovo inovovaný fotoaparát. Mobilné telefóny od Apple patria medzi najobľúbenejšie na svete.",
        "os": "iOS",
        "display": "4,7 palca",
        "cely_popis": "Apple napreduje vo všetkých smeroch, iPhone 8 Plus má mnoho „NAJ“. Jedným z nich je, že má najodolnejšie sklo. Pri vývoji sa myslelo na každučký detail, čo je dôvod, prečo iPhone 8 Plus je mikroskopicky uzavretý a to so sebou nesie odolnosť voči vode a prachu. Použité sklo je vyvinuté na mieru a špeciálne navrhnuté pre iPhone. Je vystužené oceľovou konštrukciou v kombinácii s leteckým hliníkom. Oleofóbna úprava zaisťuje, že odtlačky vašich prstov nezostanú tam, kde nemajú. Telefón nebude neustále zamastený a plný odtlačkov. Apple vidí budúcnosť, v ktorej nie sme zväzovaní s káblami. Nielen, že si takú budúcnosť vysníval, začal na nej tiež pracovať. Ďalším krokom v tomto smere je bezdrôtové nabíjanie. Koniec „šmátrania“ v polospánku a hľadanie nabíjačky, zásuvky a s tým spojená podráždenosť. Teraz stačí iPhone položiť a je to – nabíja sa. Nová technológia priamo súvisí s dizajnom zadnej strane, ktorá je vyrobená zo skla. iPhone 8 plus podporuje nabíjačky, ktoré sú bežne rozšírené v hoteloch a na letiskách. Napríklad značky Belkin a ďalšie."
    },
    {
        "img": "../images/iphone_6s.jpg",
        "alt": "APPLE_IPHONE_6S",
        "nazov": "APPLE IPHONE 6S",
        "popis": "Apple iPhone 6s 32 GB Rose Gold prináša 4,7 palcový Retina displej s rozlíšením 1334 x 750 bodov s technológiou 3D Touch a 326 ppi, kontrast 1400: 1. Čip A9 s 64-bitovou architektúrou a integrovaný pohybový koprocesor M9. Operačná pamäť RAM 2 GB, 16 GB internej pamäte.",
        "os": "iOS",
        "display": "4,7 palcov",
        "cely_popis": "Hneď ako sa prvýkrát dotkneš iPhonu 6s, pochopíš, že to bude zážitok, ktorý sa nedá porovnať s ničím, čo tu bolo doteraz. Vďaka technológii 3D Touch toho môžeš jediným stlačením urobiť viac než kedykoľvek predtým. Live Photos dokážu skutočne oživiť tvoje spomienky. A tým sa to všetko iba začína. Pozri sa iPhonu 6s pod kapotu a nájdeš v ňom inovácie na každej úrovni. Prvý iPhone naučil celý svet používať Multi-Touch. Navždy tým zmenil spôsob, akým komunikujeme s technológiami. S 3D Touch teraz môžeš robiť nové nevídané veci. Dokáže totiž vnímať s akou intenzitou tlačíš na displej, vďaka čomu môžeš robiť všetky bežné veci rýchlejšie a jednoduchšie. Navyše, úplne nový mechanizmus Taptic Engine ti pri tom dáva spätnú väzbu v reálnom čase vo forme jemných ťuknutí. Inováciu si nemusíš vždy všimnúť na prvý pohľad. Ale, ak sa lepšie prizrieš, uvidíš, že iPhone 6s je v mnohých ohľadoch výrazne zlepšený. Kryt je vyrobený z novej zliatiny hliníka skupiny 7000, ktorá sa využíva aj v leteckom priemysle. Krycie sklo je to najpevnejšie a najodolnejšie, aké sa na výrobu smartfónov dnes používa. Vďaka vyspelému, ešte rýchlejšiemu a lepšiemu, senzoru odtlačku prsta je teraz odomykanie telefónu s Touch ID ešte jednoduchšie a bezpečnejšie."
    },
    {
        "img": "../images/iphone_11.jpg",
        "alt": "Apple iPhone 11",
        "nazov": "Apple iPhone 11",
        "popis": "Vychutnaj si úžasné vizuálne zážitky na 6,1“ Liquid Retina LCD displeji. Zachyť na svojich fotkách ešte viac magických momentov vďaka novej dvojitej fotosústave 12 + 12 Mpx. Vďaka novému ultraširokouhlému 12Mpx objektívu sa na fotku vojdu všetci tvoji priatelia. Natáčaj a upravuj videá v 4K rozlíšení pri 60 fps ako profesionálny hollywoodsky režisér",
        "os": "iOS",
        "display": "6,1 palcov",
        "cely_popis": "Nová dvojitá fotosústava, s ktorou zachytíš všetky jedinečné momenty života. Najrýchlejší čip v smartphone, vďaka ktorému batéria s prehľadom zvládne deň plný zábavy a práce na jedno nabitie alebo 4K video, ktoré z tebe urobí profesionálneho režiséra. Apple iPhone 11 128GB čierna je tu a ukazuje, prečo je považovaný za kráľa medzi smartphonmi. iPhone 11 nie je len telefón, ale umelecké dielo, ktoré chceš držať v ruke. Šesť nových nádherných farieb, z ktorých si vyberie každý, konštrukcia tvorená precízne vyfrézovaným sklom z jedinej tabuľky a úžasný 6,1“ Liquid Retina displej, rozprestierajúci sa po celej prednej strane, zasadený do odolného rámu z leteckého hliníka. To je iPhone 11. Zachyť na svojich fotkách ešte viac magických momentov než kedy predtým. Zásluhou úplne novej dvojitej fotosústavy v podobe 12Mpx širokouhlého objektívu a 12Mpx ultraširokouhlého objektívu posunieš svoje fotky od širokouhlých po ultraširokouhlé. Teraz už sa na tvoje snímky vojdu všetci tvoji priatelia aj celá krajina."
    },
    {
        "img": "../images/iphone_11_pro.jpg",
        "alt": "Apple iPhone 11 Pro",
        "nazov": "Apple iPhone 11 Pro",
        "popis": "Mobilní telefon 6.5 palcov Super Retina (OLED) 2688 x 1242, procesor A13 Bionic Six-Core 512 GB, RAM 6 GB, Single SIM, Wi-Fi, Bluetooth, LTE (4G)/ 3G, GPS, NFC, iOS 13, oficiální distribuce",
        "os": "iOS",
        "display": "6.5 palcov",
        "cely_popis": "Prvý iPhone, ktorý získal pomenovanie Pro, a to naozaj zaslúžene. Prichádza totiž s revolučnou trojitou fotosústavou, ešte lepšou výdržou na nabitie, dokonalým displejom a obrovským výkonom.Trojitý fotoaparát vás dostane kvalitou aj bohatou paletou funkcií. Dokáže zachytiť až štyrikrát väčšiu scénu a nádherné fotografie získate za akéhokoľvek svetla. Kombinuje širokouhlý snímač s ultraširokouhlým objektívom a teleobjektívom.Po novom v aplikácii fotoaparátu uvidíte aj to, čo sa deje mimo záberu, aby vám už nikdy nič dôležité neuniklo.iPhone 11 je stvorený na to, aby ste s ním nahrávali tie najkrajšie videá v 4K v 60 snímkach za sekundu. S ultraširokouhlou kamerou navyše dostanete do záberu omnoho viac a k dispozícii je tiež prepracované prostredie pre jednoduchú editáciu. Apple využil nový ultraširokouhlý fotoaparát umožňujúci odzoomovať a zachytiť tak až štyrikrát širšiu scénu než doposiaľ."
    },
    {
        "img": "../images/Samsung_Galaxy_S20.jpg",
        "alt": "Samsung Galaxy S20",
        "nazov": "Samsung Galaxy S20",
        "popis": "Galaxy S20 - 6.2 palcový Dynamic AMOLED displej, 1440 x 3200 px., 8-jadrový procesor Exynos 990, 8 GB RAM a 128 GB interná pamäť, MicroSD, zadný 12 + 12 + 64 Mpx a predný 10 Mpx fotoaparát, Batéria 4 000 mAh, USB-C, rýchle a bezdrôtové nabíjanie, IP68",
        "os": "Android",
        "display": "6.2 palcov",
        "cely_popis": "Predstavujeme vám novú generáciu smartfónov z radu Galaxy S20. Spoznajte svet fotografie, aký ste nezažili. K tomu sa pridáva zabezpečenie Samsung Knox, inteligentná spotreba energie, výkonný procesor a rozsiahly úložný priestor. Verzia Galaxy S20 Ultra prichádza so 108 Mpx fotoaparátom, ktorý vám dovolí vidieť a zachytiť viac. Nenechajte si ujsť ani ten najmenší detail. Samsung Galaxy S20 a S20+ vám so 64 Mpx snímačom ponúkajú 3-násobný hybridný optický zoom a model Galaxy S20 Ultra 5G s revolučnou zloženou šošovkou až 10-násobný hybridný optický zoom. Séria Galaxy S20 dostala do vienka Dynamic AMOLED displej s certifikáciou VDE Germany a Eye Care Certification, čo znamená že získate 100% farebný obsah so zníženým objemom škodlivého modrého svetla. Stačí si len vybrať, ktorá veľkosť displeja vám vyhovuje. Ktorákoľvek z nich vám prinesie bohémsky vizuálny zážitok bez rušivých elementov."
    },
    {
        "img": "../images/Samsung_Galaxy_A51.jpg",
        "alt": "Samsung Galaxy A51",
        "nazov": "Samsung Galaxy A51",
        "popis": "Galaxy A51 - 6.5 palcový Super AMOLED displej, 1080 x 2400 px., 8-jadrový procesor Exynos 9611, 4 GB RAM a 128 pamäť, MicroSD, Zadný 48 + 12 + 5 + 5 Mpx a predný 32 Mpx fotoaparát, batéria 4 000 mAh, USB-C, rýchle nabíjanie, FM Rádio, NFC, 3.5mm jack",
        "os": "Android",
        "display": "6.5 palcov",
        "cely_popis": "Celkový dizajn zariadenia je ladený do pôvabných kriviek, ktoré dokonale zapasujú do úchopu. Každý detail je dôkladne premyslený a navrhnutý pre maximálny komfort pri používaní. Vo výbave smartfónu Galaxy A51 sa nachádza až štvorica fotoaparátov systematicky umiestnená na chrbte telefónu. Ponorte sa do nekonečného priestoru s telefónom Galaxy A51. Rozsiahly 6,5” Infinity-O FHD+ displej so Super AMOLED technológiou vás vtiahne do diania na obrazovke a zachváti vás jasnými a žiarivými farbami. Zabudovaná batéria s kapacitou 4 000mAh poskytuje dostatok energie na všetko, čo máte vo zvyku, či už streamujete videá, hráte hry alebo surfujete na sociálnej sieti. Kombinácia hlavného fotoaparátu s ultra vysokým rozlíšením 48Mpx, ultraširokouhlého 12Mpx objektívu s uhlom záberu 123°, 5Mpx Macro kamery a 5Mpx senzora si vytvoríte ostré a jasné fotografie vo dne i v noci. S Galaxy A51 sa môžete zamerať aj na ten najmenší detail. Zabudovaná 5Mpx Macro kamera s funkciou rozostrenia pozadia tzv. Bokeh efektu dokáže vašu pozornosť upriamiť na snímaný objekt a všetko ostatné sa stane nepodstatným.    "
    }
]